Revit 2024 API
DocumentCreatingEventArgs Class
 The event arguments used by the DocumentCreating event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentCreatingEventArgs : RevitAPIPreEventArgs
Visual Basic
Public Class DocumentCreatingEventArgs _
	Inherits RevitAPIPreEventArgs
Visual C++
public ref class DocumentCreatingEventArgs : public RevitAPIPreEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.DocumentCreatingEventArgs
See Also
DocumentCreatingEventArgs Members
Autodesk.Revit.DB.Events Namespace